<?php

use Illuminate\Database\Seeder;
use App\Mall;

class MallsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
		$malls = json_decode('{
			"ChIJbyssX1DO1EARSVCSAsOLcDw" : {
				"name" : "ТРЦ Глобус",
				"location" : {"lat":50.4509779,"lng":30.522565600000007},
				"status" : "3",
				"subway" : "maydan",
				"polygon_coords" : [
					{"lat": 50.45122977, "lng": 30.52266955},
					{"lat": 50.45084721, "lng": 30.52205265},
					{"lat": 50.44997961, "lng": 30.52357882},
					{"lat": 50.45041683, "lng": 30.52423328}
				]
			},
			"ChIJFRDJNVPF1EARaJOEysR5MOk" : {
				"name" : "ТРК \"Проспект\"",
				"location" : {"lat":50.45473399999999,"lng":30.635591999999974},
				"status" : "3",
				"subway" : "chern",
				"polygon_coords" : [
					{"lat": 50.45591248, "lng": 30.63571393},
					{"lat": 50.45567341, "lng": 30.63487709},
					{"lat": 50.45528405, "lng": 30.63459814},
					{"lat": 50.4552294, "lng": 30.63487709},
					{"lat": 50.45427308, "lng": 30.63548863},
					{"lat": 50.45397934, "lng": 30.63548863},
					{"lat": 50.45425941, "lng": 30.63657224},
					{"lat": 50.45415695, "lng": 30.6366688},
					{"lat": 50.45439603, "lng": 30.63759148},
					{"lat": 50.45412962, "lng": 30.63779533},
					{"lat": 50.454478, "lng": 30.63900769},
					{"lat": 50.4547649, "lng": 30.6391257},
					{"lat": 50.45518842, "lng": 30.6388253},
					{"lat": 50.45492885, "lng": 30.63788116},
					{"lat": 50.45501765, "lng": 30.63711941},
					{"lat": 50.45523623, "lng": 30.63695848},
					{"lat": 50.45519525, "lng": 30.63669026},
					{"lat": 50.4554275, "lng": 30.63650787},
					{"lat": 50.45533357, "lng": 30.63611627}
				]
			},
			"ChIJH-gHA_7O1EARkrSgsMM08gE" : {
				"name" : "Гулливер",
				"location" : {"lat":50.4387279,"lng":30.523172599999953},
				"status" : "3",
				"subway" : "palac_sportu",
				"polygon_coords" : [
					{"lat": 50.43923057, "lng": 30.52341521},
					{"lat": 50.43856945, "lng": 30.52194268},
					{"lat": 50.43842766, "lng": 30.52247375},
					{"lat": 50.43813383, "lng": 30.5228278},
					{"lat": 50.43867879, "lng": 30.52404016}
				]
			},
			"ChIJz1zRbVvF1EARpAsWRxohgJg" : {
				"name" : "ТЦ Дарница",
				"location" : {"lat":50.4425561,"lng":30.624032599999964},
				"status" : "2",
				"subway" : "chern",
				"polygon_coords" : [
					{"lat": 50.44219948, "lng": 30.62387601},
					{"lat": 50.442372, "lng": 30.62439032},
					{"lat": 50.44247022, "lng": 30.62442519},
					{"lat": 50.44254965, "lng": 30.6243702},
					{"lat": 50.44267521, "lng": 30.62387936},
					{"lat": 50.44250695, "lng": 30.62377073},
					{"lat": 50.4425283, "lng": 30.6236849},
					{"lat": 50.4424762, "lng": 30.62361516},
					{"lat": 50.4424762, "lng": 30.62351324},
					{"lat": 50.44236859, "lng": 30.62350519},
					{"lat": 50.44236773, "lng": 30.62363528},
					{"lat": 50.44232161, "lng": 30.62369563},
					{"lat": 50.44234382, "lng": 30.62377475}
				]
			},
			"ChIJ_6VNke_P1EARwx70oDQk_f0" : {
				"name" : "ТРЦ «Комод»",
				"location" : {"lat":50.4534876,"lng":30.598226599999975},
				"status" : "2",
				"subway" : "levober",
				"polygon_coords" : [
					{"lat": 50.45341066, "lng": 30.59910849},
					{"lat": 50.45329111, "lng": 30.59861496},
					{"lat": 50.45320401, "lng": 30.59848621},
					{"lat": 50.45318864, "lng": 30.59819922},
					{"lat": 50.45322963, "lng": 30.59801415},
					{"lat": 50.45331844, "lng": 30.59787467},
					{"lat": 50.45362754, "lng": 30.59767351},
					{"lat": 50.45370781, "lng": 30.59799537},
					{"lat": 50.45365487, "lng": 30.59803024},
					{"lat": 50.45368561, "lng": 30.59813485},
					{"lat": 50.45375221, "lng": 30.59810266},
					{"lat": 50.45382394, "lng": 30.59837624},
					{"lat": 50.45376929, "lng": 30.59841648},
					{"lat": 50.4538154, "lng": 30.598564},
					{"lat": 50.45389054, "lng": 30.59852108},
					{"lat": 50.45397934, "lng": 30.5987598}
				]
			},
			"ChIJT8LmwX3F1EARjio6pVZfLQk" : {
				"name" : "ТРЦ Silver Breeze",
				"location" : {"lat":50.4288706,"lng":30.59368619999998},
				"status" : "2",
				"subway" : "levober",
				"polygon_coords" : [
					{"lat": 50.42980841, "lng": 30.59395462},
					{"lat": 50.42861578, "lng": 30.59281737},
					{"lat": 50.42803141, "lng": 30.59279054},
					{"lat": 50.42788788, "lng": 30.59304267},
					{"lat": 50.42787079, "lng": 30.59395999},
					{"lat": 50.42939834, "lng": 30.59402972}
				]
			},
			"ChIJg6VB2UzE1EARjyR88wzZxbs" : {
				"name" : "Аладдін",
				"location" : {"lat":50.39590299999999,"lng":30.63243},
				"status" : "2",
				"subway" : "hark",
				"polygon_coords" : [
					{"lat": 50.39542858, "lng": 30.63305184},
					{"lat": 50.39605097, "lng": 30.63148811},
					{"lat": 50.39638439, "lng": 30.63181266},
					{"lat": 50.39620998, "lng": 30.63220158},
					{"lat": 50.39612107, "lng": 30.6321077},
					{"lat": 50.39605439, "lng": 30.63227132},
					{"lat": 50.39615869, "lng": 30.63237593},
					{"lat": 50.39575174, "lng": 30.63336298}
				]
			},
			"ChIJFSAEfFLE1EARkJ7L8H69xt0" : {
				"name" : "ТЦ Пирамида",
				"location" : {"lat":50.3977521,"lng":30.63826599999993},
				"status" : "1",
				"subway" : "hark",
				"polygon_coords" : [
					{"lat": 50.39795912, "lng": 30.63733198},
					{"lat": 50.39819763, "lng": 30.63903518},
					{"lat": 50.39795057, "lng": 30.63911833},
					{"lat": 50.39796083, "lng": 30.63921757},
					{"lat": 50.39782576, "lng": 30.63926183},
					{"lat": 50.39781037, "lng": 30.63916527},
					{"lat": 50.39754706, "lng": 30.63925512},
					{"lat": 50.39731111, "lng": 30.63755862},
					{"lat": 50.39755475, "lng": 30.63747145},
					{"lat": 50.39753338, "lng": 30.63732125},
					{"lat": 50.39766931, "lng": 30.63727297},
					{"lat": 50.3976941, "lng": 30.63741915}
				]
			}
		}', true);

		foreach ($malls as $place_id => $details) {	
			Mall::create([
		        'place_id' => $place_id,
		        'name' => $details["name"],
		        'subway' => $details["subway"],
				'status' => $details["status"],
				'location' => $details["location"]["lat"] . ':' . $details["location"]["lng"],
		        'polygon_coords' => implode(';', array_map(function ($coords) {
					return $coords["lat"] . ':' . $coords["lng"];
				}, $details["polygon_coords"]))
		    ]);
		}
    }
}
